## Dia 6

* Executar pipeline de integração de dados de empréstimos e alunos
    * Ler, tratar e limpar os dados em xls
    * Ler , tratar e limpar os dados em json
    * unir os dados da base em xls e em json
    * Ler dados de empréstimos tratados
    * salvar os dados num novo arquivo

In [51]:
# imports

import pandas as pd
import json

In [52]:
# lendo os dados de matrículas dos alunos
# necessário ter biblioteca openpyxl instalada: pip install openpyxl

data_xls_before_2010 = pd.read_excel('../datasets/dados_alunos/matricula_alunos.xlsx',engine='openpyxl', sheet_name='Até 2010')
data_xls_before_2010

,Matricula de alunos até 2010,Unnamed: 1,Unnamed: 2
0,Número da matrícula,Tipo de vinculo,Curso
1,190001688.0,ALUNO DE GRADUAÇÃO,MATEMÁTICA
2,199014489.0,ALUNO DE GRADUAÇÃO,CIÊNCIAS BIOLÓGICAS
3,199735674.0,ALUNO DE GRADUAÇÃO,MATEMÁTICA
4,199812431.0,ALUNO DE GRADUAÇÃO,LETRAS
...,...,...,...
7722,2009075211.0,ALUNO DE GRADUAÇÃO,BIBLIOTECONOMIA
7723,2009075249.0,ALUNO DE GRADUAÇÃO,ANÁLISE E DESENVOLVIMENTO DE SISTEMAS
7724,2009075294.0,ALUNO DE GRADUAÇÃO,ADMINISTRAÇÃO
7725,2009075300.0,ALUNO DE GRADUAÇÃO,MÚSICA
7726,2009075329.0,ALUNO DE GRADUAÇÃO,DIREITO

In [53]:
data_xls_after_2010 = pd.read_excel('../datasets/dados_alunos/matricula_alunos.xlsx',engine='openpyxl', sheet_name='Após 2010')
data_xls_after_2010

,Matricula de alunos após 2010,Unnamed: 1,Unnamed: 2
0,Matricula,Tipo de vinculo,Cursos
1,2010000017.0,ALUNO DE GRADUAÇÃO,DIREITO
2,2010000035.0,ALUNO DE GRADUAÇÃO,AGRONOMIA
3,2010001290.0,ALUNO DE GRADUAÇÃO,ENGENHARIA QUÍMICA
4,2010002849.0,ALUNO DE GRADUAÇÃO,ENGENHARIA AMBIENTAL
...,...,...,...
2270,20150116770.0,ALUNO DE GRADUAÇÃO,LETRAS
2271,2015074523.0,ALUNO DE GRADUAÇÃO,DANÇA
2272,20160002745.0,ALUNO DE GRADUAÇÃO,ENGENHARIA DA COMPUTAÇÃO
2273,20170086533.0,ALUNO DE GRADUAÇÃO,BIBLIOTECONOMIA
2274,20180090351.0,ALUNO DE GRADUAÇÃO,DANÇA

In [54]:
# limpando o cabeçalho duplicado da tabela data_xls_before_2010

data_xls_before_2010 = data_xls_before_2010[1:]
data_xls_before_2010.columns = ['matricula', 'vinculo','curso']

In [55]:
data_xls_before_2010

         matricula             vinculo                                  curso
1      190001688.0  ALUNO DE GRADUAÇÃO                             MATEMÁTICA
2      199014489.0  ALUNO DE GRADUAÇÃO                    CIÊNCIAS BIOLÓGICAS
3      199735674.0  ALUNO DE GRADUAÇÃO                             MATEMÁTICA
4      199812431.0  ALUNO DE GRADUAÇÃO                                 LETRAS
5      199823670.0  ALUNO DE GRADUAÇÃO                               ECOLOGIA
...            ...                 ...                                    ...
7722  2009075211.0  ALUNO DE GRADUAÇÃO                        BIBLIOTECONOMIA
7723  2009075249.0  ALUNO DE GRADUAÇÃO  ANÁLISE E DESENVOLVIMENTO DE SISTEMAS
7724  2009075294.0  ALUNO DE GRADUAÇÃO                          ADMINISTRAÇÃO
7725  2009075300.0  ALUNO DE GRADUAÇÃO                                 MÚSICA
7726  2009075329.0  ALUNO DE GRADUAÇÃO                                DIREITO

[7726 rows x 3 columns]

In [56]:
# limpando o cabeçalho duplicado da tabela data_xls_after_2010

data_xls_after_2010 = data_xls_after_2010[1:]
data_xls_after_2010.columns = ['matricula', 'vinculo','curso']

In [57]:
data_xls_after_2010

          matricula             vinculo                     curso
1      2010000017.0  ALUNO DE GRADUAÇÃO                   DIREITO
2      2010000035.0  ALUNO DE GRADUAÇÃO                 AGRONOMIA
3      2010001290.0  ALUNO DE GRADUAÇÃO        ENGENHARIA QUÍMICA
4      2010002849.0  ALUNO DE GRADUAÇÃO      ENGENHARIA AMBIENTAL
5      2010003381.0  ALUNO DE GRADUAÇÃO                 GEOGRAFIA
...             ...                 ...                       ...
2270  20150116770.0  ALUNO DE GRADUAÇÃO                    LETRAS
2271   2015074523.0  ALUNO DE GRADUAÇÃO                     DANÇA
2272  20160002745.0  ALUNO DE GRADUAÇÃO  ENGENHARIA DA COMPUTAÇÃO
2273  20170086533.0  ALUNO DE GRADUAÇÃO           BIBLIOTECONOMIA
2274  20180090351.0  ALUNO DE GRADUAÇÃO                     DANÇA

[2274 rows x 3 columns]

In [58]:
# unindo os dataframes xls em um único dataframe

data_xls = pd.concat([data_xls_before_2010, data_xls_after_2010], ignore_index=True)
data_xls

          matricula             vinculo                     curso
0       190001688.0  ALUNO DE GRADUAÇÃO                MATEMÁTICA
1       199014489.0  ALUNO DE GRADUAÇÃO       CIÊNCIAS BIOLÓGICAS
2       199735674.0  ALUNO DE GRADUAÇÃO                MATEMÁTICA
3       199812431.0  ALUNO DE GRADUAÇÃO                    LETRAS
4       199823670.0  ALUNO DE GRADUAÇÃO                  ECOLOGIA
...             ...                 ...                       ...
9995  20150116770.0  ALUNO DE GRADUAÇÃO                    LETRAS
9996   2015074523.0  ALUNO DE GRADUAÇÃO                     DANÇA
9997  20160002745.0  ALUNO DE GRADUAÇÃO  ENGENHARIA DA COMPUTAÇÃO
9998  20170086533.0  ALUNO DE GRADUAÇÃO           BIBLIOTECONOMIA
9999  20180090351.0  ALUNO DE GRADUAÇÃO                     DANÇA

[10000 rows x 3 columns]

In [59]:
data_xls.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   matricula  10000 non-null  object
 1   vinculo    10000 non-null  object
 2   curso      10000 non-null  object
dtypes: object(3)
memory usage: 234.5+ KB

In [60]:
# eliminando o ponto flutuante da coluna matricula

data_xls.loc[:,'matricula'] = data_xls['matricula'].str.replace('.0','')  
data_xls

        matricula             vinculo                     curso
0       190001688  ALUNO DE GRADUAÇÃO                MATEMÁTICA
1       199014489  ALUNO DE GRADUAÇÃO       CIÊNCIAS BIOLÓGICAS
2       199735674  ALUNO DE GRADUAÇÃO                MATEMÁTICA
3       199812431  ALUNO DE GRADUAÇÃO                    LETRAS
4       199823670  ALUNO DE GRADUAÇÃO                  ECOLOGIA
...           ...                 ...                       ...
9995  20150116770  ALUNO DE GRADUAÇÃO                    LETRAS
9996   2015074523  ALUNO DE GRADUAÇÃO                     DANÇA
9997  20160002745  ALUNO DE GRADUAÇÃO  ENGENHARIA DA COMPUTAÇÃO
9998  20170086533  ALUNO DE GRADUAÇÃO           BIBLIOTECONOMIA
9999  20180090351  ALUNO DE GRADUAÇÃO                     DANÇA

[10000 rows x 3 columns]

In [61]:
# Verificando se existem dados faltantes

data_xls.isnull().sum()

matricula    0
vinculo      0
curso        0
dtype: int64

In [62]:
# verificando se existem dados duplicados

data_xls.duplicated().sum()

np.int64(0)

In [63]:
# Lendo os dados do arquivo JSON


data_json = pd.read_json('../datasets/dados_alunos/matricula_alunos2.json')
data_json.head()

     tipo_curso                                          registros
0     GRADUACAO  [{"matricula_ou_siape": "2009029003.0", "tipo_...
1  POSGRADUACAO  [{"matricula_ou_siape": "2008112114.0", "tipo_...

In [64]:
# Parseando a variável string JSON  para DataFrame

stundents_grad = data_json['registros'][0]
stundents_post_grad = data_json['registros'][1]
data_json_grad = pd.json_normalize(json.loads(stundents_grad)) # 
data_json_post_grad = pd.json_normalize(json.loads(stundents_post_grad)) #
df_json = pd.concat([data_json_grad, data_json_post_grad], ignore_index=True)
df_json.head()

  matricula_ou_siape tipo_vinculo_usuario                   curso
0       2009029003.0   ALUNO DE GRADUAÇÃO               FILOSOFIA
1        200617346.0   ALUNO DE GRADUAÇÃO                 DIREITO
2        200746502.0   ALUNO DE GRADUAÇÃO  ENGENHARIA DE PETRÓLEO
3        200504968.0   ALUNO DE GRADUAÇÃO           ADMINISTRAÇÃO
4        200615572.0   ALUNO DE GRADUAÇÃO   CIÊNCIA DA COMPUTAÇÃO

In [65]:
# analisando os dados do DataFrame

df_json.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 82242 entries, 0 to 82241
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   matricula_ou_siape    82242 non-null  object
 1   tipo_vinculo_usuario  82242 non-null  object
 2   curso                 82242 non-null  object
dtypes: object(3)
memory usage: 1.9+ MB

In [66]:
# eliminando o ponto flutuante da coluna matricula

df_json.loc[:,'matricula_ou_siape'] = df_json['matricula_ou_siape'].str.replace('.0','')
df_json

,matricula_ou_siape,tipo_vinculo_usuario,curso
0,2009029003,ALUNO DE GRADUAÇÃO,FILOSOFIA
1,200617346,ALUNO DE GRADUAÇÃO,DIREITO
2,200746502,ALUNO DE GRADUAÇÃO,ENGENHARIA DE PETRÓLEO
3,200504968,ALUNO DE GRADUAÇÃO,ADMINISTRAÇÃO
4,200615572,ALUNO DE GRADUAÇÃO,CIÊNCIA DA COMPUTAÇÃO
...,...,...,...
82237,20201013501,ALUNO DE PÓS-GRADUAÇÃO,GESTÃO DA INFORMAÇÃO E DO CONHECIMENTO
82238,20201014062,ALUNO DE PÓS-GRADUAÇÃO,"CIÊNCIA, TECNOLOGIA E INOVAÇÃO"
82239,20201017690,ALUNO DE PÓS-GRADUAÇÃO,CIÊNCIAS DA SAÚDE
82240,20201014465,ALUNO DE PÓS-GRADUAÇÃO,DESIGN
82241,20201014993,ALUNO DE PÓS-GRADUAÇÃO,DESIGN

In [67]:
# unindo os dois DataFrames
data_xls.columns = ['matricula_ou_siape', 'vinculo', 'curso']
df_json.columns = data_xls.columns

df_all = pd.concat([data_xls, df_json], ignore_index=True)
df_all = df_all[['matricula_ou_siape', 'curso']]
df_all

      matricula_ou_siape                                   curso
0              190001688                              MATEMÁTICA
1              199014489                     CIÊNCIAS BIOLÓGICAS
2              199735674                              MATEMÁTICA
3              199812431                                  LETRAS
4              199823670                                ECOLOGIA
...                  ...                                     ...
92237        20201013501  GESTÃO DA INFORMAÇÃO E DO CONHECIMENTO
92238        20201014062          CIÊNCIA, TECNOLOGIA E INOVAÇÃO
92239        20201017690                       CIÊNCIAS DA SAÚDE
92240        20201014465                                  DESIGN
92241        20201014993                                  DESIGN

[92242 rows x 2 columns]

In [68]:
# verificando se tem dados duplicados no DataFrame final
df_all.duplicated().sum()

np.int64(0)

In [69]:
# verificando dados faltantes no DataFrame unido
df_all.isnull().sum()

matricula_ou_siape    0
curso                 0
dtype: int64

In [70]:
# verificando os cursos da base de dados unida
df_all['curso'].value_counts()

curso
ADMINISTRAÇÃO                             4575
FILOSOFIA                                 4276
ARQUITETURA E URBANISMO                   4267
ENGENHARIA CIVIL                          4141
AGRONOMIA                                 3417
MATEMÁTICA                                3330
COMUNICAÇÃO SOCIAL                        3326
CIÊNCIAS BIOLÓGICAS                       3306
BIBLIOTECONOMIA                           3282
CIÊNCIAS SOCIAIS                          3279
CIÊNCIA DA COMPUTAÇÃO                     3273
DANÇA                                     3263
SISTEMAS DE INFORMAÇÃO                    3237
DIREITO                                   3225
CIÊNCIAS E TECNOLOGIA                     2938
CIÊNCIAS ATUARIAIS                        2921
ENGENHARIA DE PETRÓLEO                    2908
EDUCAÇÃO FÍSICA                           2867
ENGENHARIA FLORESTAL                      2867
ENFERMAGEM                                2855
PEDAGOGIA                                 2847
BIOMEDICINA                               2806
GESTÃO DA INFORMAÇÃO E DO CONHECIMENTO    1456
CIÊNCIA E ENGENHARIA DE MATERIAIS         1411
ENGENHARIA DE SOFTWARE                    1410
DESIGN                                    1404
BIOQUÍMICA                                1395
CIÊNCIAS ODONTOLÓGICAS                    1391
CIÊNCIAS DA SAÚDE                         1383
CIÊNCIA, TECNOLOGIA E INOVAÇÃO            1375
ARTES CÊNICAS                             1346
BIOINFORMÁTICA                            1338
ENGENHARIA QUÍMICA                         475
ECOLOGIA                                   464
FISIOTERAPIA                               454
GEOGRAFIA                                  445
NUTRIÇÃO                                   438
ENGENHARIA DA COMPUTAÇÃO                   438
ANÁLISE E DESENVOLVIMENTO DE SISTEMAS      435
MÚSICA                                     427
TURISMO                                    416
ENGENHARIA AMBIENTAL                       393
LETRAS                                     388
HISTÓRIA                                   354
Name: count, dtype: int64

In [71]:
# lendo os dados de empréstimos de exemplares

df_data_loans = pd.read_parquet('../datasets/dados_tratados/dados_emprestimos_tratados.parquet')
df_data_loans.head()

,id_emprestimo,codigo_barras,data_renovacao,data_emprestimo,data_devolucao,matricula_ou_siape,tipo_vinculo_usuario,id_exemplar,colecao,biblioteca,status_material,localizacao,classificacao_cdu
0,9405484,2011010806,2017-01-13 07:22:40.736,2017-01-02 08:01:14.113,2017-01-30 07:05:05,2014035816,ALUNO DE GRADUAÇÃO,915480,Acervo Circulante,Biblioteca Setorial Profª. Maria José Mamede G...,REGULAR,689,Ciências aplicadas
1,9405492,2010040100,2017-01-31 07:31:36.902,2017-01-02 08:29:46.722,2017-02-21 13:16:33,20161011168,ALUNO DE PÓS-GRADUAÇÃO,1051275,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,651,Ciências aplicadas
2,9405496,2013105705,2017-01-31 07:31:36.843,2017-01-02 08:29:46.794,2017-02-21 13:15:46,20161011168,ALUNO DE PÓS-GRADUAÇÃO,1097159,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,380,Ciências sociais
3,9405504,H004983,2017-01-31 07:31:36.786,2017-01-02 08:46:42.991,2017-02-22 16:10:28,20161011168,ALUNO DE PÓS-GRADUAÇÃO,132715,Acervo Circulante,Biblioteca Setorial do Centro de Ciências Huma...,REGULAR,635,Ciências aplicadas
4,9405508,H011333,2017-01-31 07:31:36.658,2017-01-02 08:46:43.400,2017-02-22 16:10:40,20161011168,ALUNO DE PÓS-GRADUAÇÃO,180475,Acervo Circulante,Biblioteca Setorial do Centro de Ciências Huma...,REGULAR,632,Ciências aplicadas

In [72]:
# unindo os dados de alunos com os dados de empréstimos

df_merged = pd.merge(df_data_loans, df_all, how='left', left_on='matricula_ou_siape', right_on='matricula_ou_siape')
df_merged.head()

,id_emprestimo,codigo_barras,data_renovacao,data_emprestimo,data_devolucao,matricula_ou_siape,tipo_vinculo_usuario,id_exemplar,colecao,biblioteca,status_material,localizacao,classificacao_cdu,curso
0,9405484,2011010806,2017-01-13 07:22:40.736,2017-01-02 08:01:14.113,2017-01-30 07:05:05,2014035816,ALUNO DE GRADUAÇÃO,915480,Acervo Circulante,Biblioteca Setorial Profª. Maria José Mamede G...,REGULAR,689,Ciências aplicadas,ENGENHARIA CIVIL
1,9405492,2010040100,2017-01-31 07:31:36.902,2017-01-02 08:29:46.722,2017-02-21 13:16:33,20161011168,ALUNO DE PÓS-GRADUAÇÃO,1051275,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,651,Ciências aplicadas,FILOSOFIA
2,9405496,2013105705,2017-01-31 07:31:36.843,2017-01-02 08:29:46.794,2017-02-21 13:15:46,20161011168,ALUNO DE PÓS-GRADUAÇÃO,1097159,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,380,Ciências sociais,FILOSOFIA
3,9405504,H004983,2017-01-31 07:31:36.786,2017-01-02 08:46:42.991,2017-02-22 16:10:28,20161011168,ALUNO DE PÓS-GRADUAÇÃO,132715,Acervo Circulante,Biblioteca Setorial do Centro de Ciências Huma...,REGULAR,635,Ciências aplicadas,FILOSOFIA
4,9405508,H011333,2017-01-31 07:31:36.658,2017-01-02 08:46:43.400,2017-02-22 16:10:40,20161011168,ALUNO DE PÓS-GRADUAÇÃO,180475,Acervo Circulante,Biblioteca Setorial do Centro de Ciências Huma...,REGULAR,632,Ciências aplicadas,FILOSOFIA

In [73]:
# vericando os dados faltantes no DataFrame final
df_merged.isnull().sum()

id_emprestimo                 0
codigo_barras                 0
data_renovacao          1162079
data_emprestimo               0
data_devolucao             6178
matricula_ou_siape            0
tipo_vinculo_usuario          0
id_exemplar                   0
colecao                       0
biblioteca                    0
status_material               0
localizacao                   0
classificacao_cdu             0
curso                    157894
dtype: int64

In [74]:
# verificando dados duplicados no DataFrame final
df_merged.duplicated().sum()

np.int64(0)

In [75]:
# salvando os dados tratados em um arquivo parquet

df_merged.to_parquet('../datasets/dados_tratados/dados_emprestimos_com_alunos.parquet', index=False)